[
  {
    "icon": "🛠️",
    "title": "Web & Mobile Developer at Intellismart Technology",
    "date": "Sept 2024 - Present",
    "description": [
      "In charge of development of HR Management System Web Application Version 2.",
      "Maintain and enhance existing HR Management System Mobile Application.",
      "Developed Scalable Codebase and Modular Architecture.",
      "Utilized React JS, React Native, Typescript, .Net and MSSQL.",
      "Utilized Jira and Git for project collaboration and version control.",
      "Collaborated with QA and PMs in Agile sprints, ensuring feature quality through daily stand-ups."
    ]
  },
  {
    "icon": "🛠️",
    "title": "Freelance Full Stack Developer",
    "date": "November 2023 - Present",
    "description": [
      "Delivered custom web solution ranging from small to medium businesses including Adamson Research Repository Management System, Disaster and Risk Management System, New Era Service Booking System, Kichieats.",
      "Collaborated with both local and international clients, including those based in Australia and Japan",
      "Built scalable, responsive web apps for performance and user satisfaction.",
      "Developed RESTful APIs to ensure scalability and efficient communication between services.",
      "Deployed projects via Hostinger, Vercel, shared hosting, AWS EC2 and VPS environments.",
      "Enhanced SEO and integrated GA4 for improved visibility, accessibility, and user insights.",
      "Designed ERDs and optimized databases for performance and scalability.",
      "Expertise in multiple programming languages and frameworks including PHP, Typescript, Java, and framework such as React, Next, Vue, Nuxt, Laravel, NodeJS, Spring boot."
    ]
  },
  {
    "icon": "🛠️",
    "title": "Full Stack Developer Intern at INGCO PH",
    "date": "June 2023 - Aug 2023",
    "description": [
      "Maintained and implemented updates in the existing internal ticketing system and optimized its performance",
      "Developed a web-based ticketing system for external users to integrate with the existing internal ticketing system.",
      "Implemented a scheduler to synchronize a cloud database with an on-premises database.",
      "Utilized Vue JS, Vuetify and Vuex for Frontend, Laravel and MySQL for Backend Development.",
      "Collaborated with other developers using Git, actively following the guidance of our seniors and the manager."
    ]
  },
  {
    "icon": "🛠️",
    "title": "BS Computer Science at University of Caloocan City",
    "date": "2020 - 2024",
    "description": [
      "Developed strong programming fundamentals, with hands-on experience in frontend, backend, and DevOps.",
      "Collaborated with fellow tech enthusiasts on various academic and extracurricular projects.",
      "Participated in app development competitions and coding contests, honing problem-solving and teamwork skills.",
      "Engaged in coursework that covered algorithms, data structures, and software engineering principles."
    ]
  }
]